app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "10"]]
---
  def show
    @event = Event.find(params[:id])

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "10"]]
---
  def edit
    @event = Event.find(params[:id])

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "10"]]
UPDATE "events" SET "capacity" = ?, "starts_at" = ?, "updated_at" = ? WHERE "events"."id" = 1  [["capacity", 3], ["starts_at", Thu, 06 Nov 2014 17:18:00 UTC +00:00], ["updated_at", Tue, 29 Jul 2014 17:37:38 UTC +00:00]]
---
  def update
    @event = Event.find(params[:id])
    if @event.update(event_params)

INSERT INTO "events" ("capacity", "created_at", "description", "image_file_name", "location", "name", "price", "starts_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @event = Event.new(event_params)
    if @event.save

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 1]]
---
  def destroy
    @event = Event.find(params[:id])
    @event.destroy